import matplotlib.pyplot as plt
import csv
sizes = [11,21,31,41,51,61,71,81,91,101,201,301,401,501]
X = [ 0.015625 ,  0.0625 ,0.15625, 0.34375, 0.65625, 1.04688 ,1.76562 ,2.85938 ,3.54688, 4.71875, 37.7031, 145.453 , 358.453, 810.516]
Y = [0.015625, 0.046875 ,0.125, 0.296875  ,0.515625,  0.90625 ,1.32812, 1.95312,  2.70312 ,3.67188, 29.6719 ,111.656, 350.109 ,636.422] 
Z = [ 0.015625, 0.046875, 0.109375, 0.265625, 0.484375, 0.8125, 1.3125 ,1.92188 ,2.6875 ,3.57812  ,29.2188, 108.859 ,282.562 ,590.203] 
 
fig1 = plt.figure(figsize=(10, 7))
plot = fig1.add_subplot()
plot.plot(sizes, X, label = "Стандартный алгоритм")
plot.plot(sizes, Y, label="Алгоритм Винограда")
plot.plot(sizes, Z, label="Оптимизированный алгоритм Винограда")
plt.legend()
plt.grid()
plt.title("Временные характеристики алгоритмов матричного умножения")
plt.ylabel("Затраченное время (мc)")
plt.xlabel("Размер матрицы")
plt.show()
