import matplotlib.pyplot as plt
import csv
sizes = [0.053827974144679464, 0.10869970402069618,0.5190448143978648,0.9782973361862657,2.329811900306417,3.8650274731419283,5.326285497014113,7.683384154296919,11.941907538153,21.192565477033646,47.598989048020215 ,95.28222409435551]
X = [0.75 ,0.77,0.81,0.91,1.03,1.20,1.33,1.61,2.04,3.37,5.94,7.99]
Y = [0.28,0.33,0.38 ,0.44,0.51,0.55,0.76,0.80,0.96,1.37,2.15,2.76 ] 
#Z = [0.0534375 ,0.089375, 0.130625, 0.169219, 0.2125] 
 
fig1 = plt.figure(figsize=(10, 7))
plot = fig1.add_subplot()
plot.plot(sizes, X, label = "Без параллелизации")
plot.plot(sizes, Y, label="Сортировка слиянием")
#plot.plot(sizes, Z, label="Блочная сортировка")
plt.legend()
plt.grid()
plt.title("Временные характеристики алгоритма трассировки лучей")
plt.ylabel("Затраченное время (c)")
plt.xlabel("Процент заполнения")
plt.show()
