import matplotlib.pyplot as plt
import csv
sizes = [1,2,3,4,5,6,7,8,9,10]
X = [0.0003125,  0.000703125  ,  0.000953125 , 0.00110937 ,0.00135937 ,0.00179688, 0.00198438 ,0.00253125, 0.003125, 0.00346875 ]
Y = [0.0004375 ,0.000640625  ,0.0009375 ,0.00117187   , 0.00148438, 0.00184375, 0.00223437 , 0.002625  , 0.00310938, 0.00378125 ]
Z = [ 0.000265625, 0.00071875 , 0.000953125, 0.00128125  ,0.0018125 , 0.00225, 0.0024375 , 0.00332812   , 0.00403125, 0.0046875]
A = [0 ,0 ,0 ,0.0046875, 0.0234375 ,0.129688, 0.66875 ,3.89062 ,21.7312 ,  125.583 ]
 
fig1 = plt.figure(figsize=(10, 7))
plot = fig1.add_subplot()
plot.plot(sizes, X, label = "Левенштейна")
plot.plot(sizes, Y, label="Дамерау-Левенштейна матричный")
plot.plot(sizes, Z, label="Дамерау-Левенштейна рекурсивный с кешем")
#plot.plot(sizes, A, label="Дамерау-Левенштейна рекурсивный")
plt.legend()
plt.grid()
plt.title("Временные характеристики алгоритмов поиска расстояний")
plt.ylabel("Затраченное время (мc)")
plt.xlabel("Размер строки")
plt.show()
