import matplotlib.pyplot as plt
import csv
sizes = [10,20,30,40,50,60,70,80,90,100,200,300,400,500]
X = [0.003125, 0.0125 ,0.00625, 0.021875, 0.053125, 0.084375 , 0.096875 ,0.146875, 0.184375 ,0.196875  , 0.85625,  1.88437 , 3.40937 , 5.40313 ]
Y = [ 0, 0.00625   , 0.021875, 0.040625  ,0.065625 ,  0.059375 , 0.10625 , 0.15625 , 0.178125 , 0.228125 , 0.925 , 2  , 3.5875 ,5.59687 ]
Z = [  0.00625, 0.015625, 0.034375,0.028125 ,0.09375 ,0.1375 ,0.19375 ,0.2125, 0.3125 ,0.4 ,1.58125 ,3.5 ,6.34063 ,9.7375]
A = [0 ,0 ,0 ,0.0046875, 0.0234375 ,0.129688, 0.66875 ,3.89062 ,21.7312 ,  125.583 ]
 
fig1 = plt.figure(figsize=(10, 7))
plot = fig1.add_subplot()
plot.plot(sizes, X, label = "Левенштейна")
plot.plot(sizes, Y, label="Дамерау-Левенштейна матричный")
plot.plot(sizes, Z, label="Дамерау-Левенштейна рекурсивный с кешем")
#plot.plot(sizes, A, label="Дамерау-Левенштейна рекурсивный")
plt.legend()
plt.grid()
plt.title("Временные характеристики алгоритмов поиска расстояний")
plt.ylabel("Затраченное время (мc)")
plt.xlabel("Размер строки")
plt.show()
