import matplotlib.pyplot as plt
import csv
sizes = [0.0713107812987476 , 0.13537906137184114 ,0.29471408833623036 ,1.071054508178455 ,3.2791817087845967, 8.433614119534697 ,23.345645585416946 ,69.19374247894103 ,91.4560770156438 ,100]
X = [0.0, 0.0, 0.0, 0.0, 0.01, 0.02, 0.04, 0.09, 0.19, 0.33]
Y = [0.0, 0.0, 0.01, 0.02, 0.03, 0.08, 0.24, 1.07, 2.63, 4.86]
Z =[0.0, 0.0, 0.01, 0.01, 0.03, 0.10, 0.26, 1.09, 3.06, 5.27]

 
fig1 = plt.figure(figsize=(10, 7))
plot = fig1.add_subplot()
plot.plot(sizes, X, label = "алгоритм с интерполяцией")
plot.plot(sizes, Z, label="алгоритм с барицентрическими координатами")
plot.plot(sizes, Y, label="оптимизированный алгоритм с барицентрическими координатами")
#plot.plot(sizes, A, label="Дамерау-Левенштейна рекурсивный")
plt.legend()
plt.grid()
plt.title("Временные характеристики алгоритмов растеризации")
plt.ylabel("Затраченное время (мc)")
plt.xlabel("Доля заполнения экрана")
plt.show()
