import matplotlib.pyplot as plt
import csv
sizes = [10,20,30,40,50,60,70,80,90,100,200,300,400,500]
X = [0,0.03125, 0.0625, 0.046875, 0.34375, 0.671875,1.04688,   1.57812, 2.34375, 3.07812, 25, 85.7031, 206.312, 411.062]
Y = [0.015625, 0.03125, 0.03125, 0.0625,  0.28125, 0.4375 , 0.65625, 1.15625 , 1.6875, 2.23438, 18.0781, 63.2656,  150.75, 301.531 ] 
Z = [0, 0.015625,0.03125 , 0.0625, 0.296875 ,0.4375 ,0.78125 ,1.14062 ,1.625,  2.23438, 18.1406, 61.4531 ,150.516, 302.391] 
 
fig1 = plt.figure(figsize=(10, 7))
plot = fig1.add_subplot()
plot.plot(sizes, X, label = "Стандартный алгоритм")
plot.plot(sizes, Y, label="Алгоритм Винограда")
plot.plot(sizes, Z, label="Оптимизированный алгоритм Винограда")
plt.legend()
plt.grid()
plt.title("Временные характеристики алгоритмов матричного умножения")
plt.ylabel("Затраченное время (мc)")
plt.xlabel("Размер матрицы")
plt.show()
